"""

[APPENDIX A - 코딩 테스트를 위한 파이썬 문법]

[6] 주요 라이브러리의 문법과 유의점
: 표준라이브러리란 특정한 프로그래밍 언어에서 자주 사용되는 표준 소스코드를 미리 구현해 놓은 라이브러리이다.
코딩 테스트에서는 대부분 표준 라이브러리를 사용할 수 있도록 허용한다.

6-1) 내장함수 : print(), input(), sorted() 등의 기본 내장 라이브러리. 꼭 필요한 필수 기능들이 있음

6-2) itertools : 순열과 조합 라이브러리

6-3) heapq : 힙(Heap) 기능을 제공하는 라이브러리. 우선순위 큐 기능을 구현하기 위해 사용함

6-4) bisect : 이진 탐색(Binary Search) 기능을 제공하는 라이브러리

6-5) collections : 덱(deque), 카운터(counter) 등의 유용한 자료구조를 포함하고 있는 라이브러리

6-6) math : 필수적인 수학적 기능(factorial, sqaure root, 최대공약수, 삼각함수, pi 등)을 제공하는 라이브러리

"""
